Catalogs/ВиртуальныеСклады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ВиртуальныеСклады</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПризнакОприходования</Name>
					<Comment>Признак оприходования по ЭСФ, ДТ и ФНО328</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтруктурнаяЕдиницаЭСФ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВиртуальныхСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСклада</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяСкладомПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВиртуальныхСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИИНОтветственногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПубличногоСклада</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладУСД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладРеорганизуемогоЛица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереработкаДавальческогоСырья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладДляЛизинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИНЛизингополучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораЛизингополучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговораЛизингополучателя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СтатусыВиртуальныхСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыВиртуальныхСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСозданВС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неактивен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВиртуальныеСклады/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа И ПризнакОприходования Тогда
		СкладСПризнаком = СкладСПризнакомОприходования();
		Если СкладСПризнаком <> Неопределено Тогда
			Попытка
				ОбъектСклад = СкладСПризнаком.ПолучитьОбъект();
				ОбъектСклад.ПризнакОприходования = Ложь;
				ОбъектСклад.Записать();
				ТекстСообщения =  НСтр("ru = 'У склада %Склад1% снят ""Признак  оприходования товаров по ДТ"". Признак установлен у склада %Склад2%.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад1%", СокрЛП(ОбъектСклад.Ссылка));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад2%", СокрЛП(Ссылка));
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);

			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать элемент справочника ""Виртуальные склады"".'"), 
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			КонецПопытки;
			
			
			//Отказ = истина;
			//ТекстСообщения = НСтр("ru = 'Не удалось записать %1.
			//|В системе уже присутствует склад %2 с признаком оприходования.'");
			//ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения,  Наименование, СкладСПризнаком);
			
			//ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И ЯвляетсяСкладомПоУмолчанию Тогда
		СкладСПризнакомПоУмолчанию = СкладСПризнакомЯвляетсяСкладомПоУмолчанию();
		
		Если СкладСПризнакомПоУмолчанию <> Неопределено Тогда
			Попытка
				ОбъектСклад = СкладСПризнакомПоУмолчанию.ПолучитьОбъект();
				ОбъектСклад.ЯвляетсяСкладомПоУмолчанию = Ложь;
				ОбъектСклад.Записать();	
				ТекстСообщения =  НСтр("ru = 'У склада %Склад1 снят признак ""Приоритетный склад"". Признак ""Приоритетный склад"" установлен у склада %Склад2.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад1", СокрЛП(ОбъектСклад.Ссылка));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад2", СокрЛП(Ссылка));
				ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);

			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать элемент справочника ""Виртуальные склады"".'"), 
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			КонецПопытки;

			//Отказ = истина;
			//ТекстСообщения = НСтр("ru = 'Не удалось записать %1.
			//|В системе уже присутствует склад %2 с признаком ""Является складом по умолчанию"".'");
			//ТекстСообщения = ЭСФКлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения,  Наименование, СкладСПризнакомПоУмолчанию);
			//
			//ЭСФКлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СкладСПризнакомЯвляетсяСкладомПоУмолчанию()
	
	СкладСПризнакомПоУмолчанию = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВиртуальныеСклады.Ссылка
		|ИЗ
		|	Справочник.ВиртуальныеСклады КАК ВиртуальныеСклады
		|ГДЕ
		|	ВиртуальныеСклады.Организация = &Организация
		|	И НЕ ВиртуальныеСклады.Ссылка = &Ссылка
		|	И ВиртуальныеСклады.ЯвляетсяСкладомПоУмолчанию";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 СкладСПризнакомПоУмолчанию = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат СкладСПризнакомПоУмолчанию;
	
КонецФункции

Функция СкладСПризнакомОприходования()
	СкладСПризнаком = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВиртуальныеСклады.Ссылка
		|ИЗ
		|	Справочник.ВиртуальныеСклады КАК ВиртуальныеСклады
		|ГДЕ
		|	ВиртуальныеСклады.Организация = &Организация
		|	И НЕ ВиртуальныеСклады.Ссылка = &Ссылка
		|	И ВиртуальныеСклады.ПризнакОприходования = ИСТИНА";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 СкладСПризнаком = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат СкладСПризнаком 
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЗначениеЗаполнено(ОбъектКопирования.ИдентификаторСклада) Тогда
		ИдентификаторСклада = Неопределено;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОбъектКопирования.Статус) Тогда
		Статус = Перечисления.СтатусыВиртуальныхСкладов.НеСозданВС // по умолчанию новый документ имеет не создан
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
